tutorials/combustion/XiFoam/les/pitzDaily3D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

(    inlet
    {
        type            patch;
        startFace       715675;
        nFaces          600;
    }

    outlet
    {
        type            patch;
        startFace       716275;
        nFaces          1140;
    }

    upperWall
    {
        type            wall;
        startFace       717415;
        nFaces          4460;
    }

    lowerWall
    {
        type            wall;
        startFace       721875;
        nFaces          5000;
    }

    frontAndBack
    {
        type            cyclic;
        startFace       726875;
        nFaces          24450;
    }

)

// ************************************************************************* //
