tutorials/combustion/XiFoam/les/pitzDaily3D/constant/LESProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      LESProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

LESModel        oneEqEddy;

delta           cubeRootVol;

printCoeffs     on;

laminarCoeffs
{
}

oneEqEddyCoeffs
{
    ce              1.048;
    ck              0.094;
}

dynOneEqEddyCoeffs
{
    ce              1.05;
    filter          simple;
}

lowReOneEqEddyCoeffs
{
    ck              0.07;
    ce              1.05;
    beta            0.01;
}

SmagorinskyCoeffs
{
    ck              0.02;
    ce              0.202;
}

DeardorffDiffStressCoeffs
{
    ce              1.048;
    ck              0.094;
    cm              4.13;
}

cubeRootVolCoeffs
{
    deltaCoeff      1;
}

PrandtlCoeffs
{
    delta           cubeRootVol;
    cubeRootVolCoeffs
    {
        deltaCoeff      1;
    }

    smoothCoeffs
    {
        delta           cubeRootVol;
        cubeRootVolCoeffs
        {
            deltaCoeff      1;
        }

        maxDeltaRatio   1.1;
    }

    Cdelta          0.158;
}

vanDriestCoeffs
{
    delta           cubeRootVol;
    cubeRootVolCoeffs
    {
        deltaCoeff      1;
    }

    smoothCoeffs
    {
        delta           cubeRootVol;
        cubeRootVolCoeffs
        {
            deltaCoeff      1;
        }

        maxDeltaRatio   1.1;
    }

    Aplus           26;
    Cdelta          0.158;
}

smoothCoeffs
{
    delta           cubeRootVol;
    cubeRootVolCoeffs
    {
        deltaCoeff      1;
    }

    maxDeltaRatio   1.1;
}

kappa           0.4187;

wallFunctionCoeffs
{
    E               9;
}


// ************************************************************************* //
