tutorials/combustion/XiFoam/les/pitzDaily3D/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 2e-05;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 2e-05;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 2e-05;
        value           uniform 2e-05;
    }

    upperWall
    {
        type            fixedValue;
        value           uniform 1e-8;
    }

    lowerWall
    {
        type            fixedValue;
        value           uniform 1e-8;
    }

    frontAndBack
    {
        type            cyclic;
    }
}

// ************************************************************************* //
